app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @location = Location.find(params[:id])

INSERT INTO "locations" ("city", "created_at", "lat", "lon", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?)  [["city", nil], ["created_at", Wed, 27 Mar 2013 18:16:23 UTC +00:00], ["lat", nil], ["lon", nil], ["state", nil], ["updated_at", Wed, 27 Mar 2013 18:16:23 UTC +00:00], ["zip", "46038"]]
---
  def create
    @location = Location.new(params[:location])
    @location.get_geolookup(params[:location][:zip])

    respond_to do |format|
      if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy